Project/Toir/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <type>
      <types>DefinedType.торо_СогласуемыеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ИсторияСтатусовСогласованияДокументов/торо_ИсторияСтатусовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИсторияСтатусовСогласованияДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <type>
      <types>DefinedType.торо_СогласуемыеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаКого</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_СрокиСогласования/гкс_СрокиСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СрокиСогласования</name>
  <resources>
    <name>Срок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Способ</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_ОтправленныеУведомленияОСроках/гкс_ОтправленныеУведомленияОСроках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ОтправленныеУведомленияОСроках</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>Способ</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.торо_СогласуемыеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОтмененныеРемонты/торо_ОтмененныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОтмененныеРемонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_СрокиСОповещаемые/гкс_СрокиСОповещаемые.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СрокиСОповещаемые</name>
  <dimensions>
    <name>Способ</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/CommonModules/гкс_СрокСогласованияНаСервере/Module.bsl
// гкс+ [разработка 2021] Куст 13.05.2021
// Регламентное задание проверки и уведомления о превышении срока согласования
Процедура гкс_ПроверитьСрокиСогласования() Экспорт
	СобытиеИстечения = Константы.гкс_СобытиеИстеченияСрокаСогласования.Получить();
	СобытиеПросрочки = Константы.гкс_СобытиеПросрочкиСрокаСогласования.Получить();
	Если Не (ЗначениеЗаполнено(СобытиеПросрочки) ИЛИ ЗначениеЗаполнено(СобытиеИстечения)) Тогда 
		Возврат;
	КонецЕсли;
	//	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент КАК Документ,
		|	РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК Статус,
		|	&СпособТекст КАК Способ,
		|	История.Период КАК ДатаСтатуса
		|ПОМЕСТИТЬ ВсеСтатусы
		|ИЗ
		|	РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов.СрезПоследних КАК История
		|		ПО РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = История.СогласуемыйДокумент
		|			И РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента = История.СтатусДокумента
		|ГДЕ
		|	РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеСтатусы.Документ КАК Документ,
		|	ВсеСтатусы.Статус КАК Статус,
		|	ВсеСтатусы.Способ КАК Способ,
		|	ДОБАВИТЬКДАТЕ(ВсеСтатусы.ДатаСтатуса, ДЕНЬ, РегистрСведенийгкс_СрокиСогласования.Срок) КАК ДатаОкончания,
		|	РегистрСведенийгкс_СрокиСогласования.Срок > &ДоСрок КАК ЕстьДоСрок,
		|	ДОБАВИТЬКДАТЕ(ВсеСтатусы.ДатаСтатуса, ДЕНЬ, РегистрСведенийгкс_СрокиСогласования.Срок - &ДоСрок) КАК ДатаПредупреждения,
		|	ЕСТЬNULL(Отправленные.Событие, """") КАК ИмяСобытия
		|ПОМЕСТИТЬ Неотправленные
		|ИЗ
		|	ВсеСтатусы КАК ВсеСтатусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СрокиСогласования КАК РегистрСведенийгкс_СрокиСогласования
		|		ПО ВсеСтатусы.Способ = РегистрСведенийгкс_СрокиСогласования.Способ
		|			И ВсеСтатусы.Статус = РегистрСведенийгкс_СрокиСогласования.Статус
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ОтправленныеУведомленияОСроках КАК Отправленные
		|		ПО ВсеСтатусы.Документ = Отправленные.Документ
		|			И ВсеСтатусы.Статус = Отправленные.Статус
		|			И ВсеСтатусы.Способ = Отправленные.Способ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Неотправленные.Документ КАК Документ,
		|	Неотправленные.Статус КАК Статус,
		|	Неотправленные.Способ КАК Способ,
		|	Неотправленные.ДатаОкончания КАК ДатаОкончания,
		|	Неотправленные.ДатаОкончания <= &ТекДата КАК Просрочка,
		|	Неотправленные.ЕстьДоСрок КАК ЕстьДоСрок,
		|	Неотправленные.ДатаПредупреждения КАК ДатаПредупреждения
		|ПОМЕСТИТЬ ТЧ_Результат
		|ИЗ
		|	Неотправленные КАК Неотправленные
		|ГДЕ
		|	(Неотправленные.ДатаОкончания <= &ТекДата
		|			ИЛИ Неотправленные.ЕстьДоСрок = ИСТИНА
		|				И Неотправленные.ДатаПредупреждения <= &ТекДата
		|				И Неотправленные.ИмяСобытия = """")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_РемонтыСрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ Отмененные
		|ИЗ
		|	РегистрСведений.торо_Ремонты.СрезПоследних(
		|			,
		|			Регистратор В
		|				(ВЫБРАТЬ
		|					ТЧ.Документ
		|				ИЗ
		|					ТЧ_Результат КАК ТЧ)) КАК торо_РемонтыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонтыСрезПоследних
		|		ПО (торо_РемонтыСрезПоследних.ID = торо_ОтмененныеРемонтыСрезПоследних.ID
		|				И торо_ОтмененныеРемонтыСрезПоследних.Отменен = ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧ_Результат.Способ КАК Способ,
		|	ТЧ_Результат.Статус КАК Статус,
		|	РегистрСведенийгкс_СрокиСогласования.Адрес КАК Адрес
		|ИЗ
		|	ТЧ_Результат КАК ТЧ_Результат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СрокиСОповещаемые КАК РегистрСведенийгкс_СрокиСогласования
		|		ПО ТЧ_Результат.Способ = РегистрСведенийгкс_СрокиСогласования.Способ
		|			И ТЧ_Результат.Статус = РегистрСведенийгкс_СрокиСогласования.Статус
		|		ЛЕВОЕ СОЕДИНЕНИЕ Отмененные КАК Отмененные
		|		ПО ТЧ_Результат.Документ = Отмененные.Регистратор
		|ГДЕ
		|	Отмененные.Регистратор ЕСТЬ NULL
		|ИТОГИ ПО
		|	Способ,
		|	Статус
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ_Результат.Документ КАК Документ,
		|	ТЧ_Результат.Статус КАК Статус,
		|	ТЧ_Результат.Способ КАК Способ,
		|	ТЧ_Результат.Просрочка КАК Просрочка,
		|	ТЧ_Результат.ДатаОкончания КАК ДатаОкончания,
		|	ТЧ_Результат.ЕстьДоСрок КАК ЕстьДоСрок,
		|	ТЧ_Результат.ДатаПредупреждения КАК ДатаПредупреждения
		|ИЗ
		|	ТЧ_Результат КАК ТЧ_Результат
		|		ЛЕВОЕ СОЕДИНЕНИЕ Отмененные КАК Отмененные
		|		ПО ТЧ_Результат.Документ = Отмененные.Регистратор
		|ГДЕ
		|	Отмененные.Регистратор ЕСТЬ NULL";
	//
	ТекстПоляСпособ = "ВЫБОР ";
	МассивТиповТекст = Новый Массив();
	Для Каждого СтрокаМассива Из Метаданные.ОпределяемыеТипы.торо_СогласуемыеДокументы.Тип.Типы() Цикл
		ОбъектТипа = Метаданные.НайтиПоТипу(СтрокаМассива);
		Если Метаданные.Документы.Содержит(ОбъектТипа) = Истина Тогда 
			МассивТиповТекст.Добавить("КОГДА РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент
			|	Ссылка Документ." + ОбъектТипа.Имя + " 
			|	Тогда Выразить(РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент 
			|	КАК Документ." + ОбъектТипа.Имя + " ).СпособСогласования
			|");
		КонецЕсли;
	КонецЦикла;
	ТекстПоляСпособ = ТекстПоляСпособ + СтрСоединить(МассивТиповТекст, " ") + " ИНАЧЕ null КОНЕЦ ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СпособТекст", ТекстПоляСпособ);
	ТекДата = ТекущаяДата();
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("ДоСрок", Константы.гкс_КолвоДнейДоОкончанияСрокаСогласования.Получить());
	ПакетАдреса = 4;
	ПакетОснова = ПакетАдреса + 1;
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатЗапроса[ПакетОснова].Пустой() Тогда 
		ВыборкаСпособ = РезультатЗапроса[ПакетАдреса].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаДок = РезультатЗапроса[ПакетОснова].Выбрать();
		Пока ВыборкаДок.Следующий() Цикл
			ВыборкаСпособ.Сбросить();
			Оповещаемые = Новый Массив();
			Если ВыборкаСпособ.НайтиСледующий(Новый Структура("Способ", ВыборкаДок.Способ)) Тогда 
				ВыборкаСтатус = ВыборкаСпособ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Если ВыборкаСтатус.НайтиСледующий(Новый Структура("Статус", ВыборкаДок.Статус)) Тогда 
					Выборка = ВыборкаСтатус.Выбрать();
					Пока Выборка.Следующий() Цикл
						Оповещаемые.Добавить(Выборка.Адрес);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			Отказ = Ложь;
			Если ВыборкаДок.ЕстьДоСрок И Не ВыборкаДок.Просрочка Тогда 
				ИмяСобытия = "Истекает";
				Если ЗначениеЗаполнено(СобытиеИстечения) Тогда 
					торо_РаботаСУведомлениями.гкс_ЗаписатьУведомленияСрокаСогласования(ВыборкаДок.Документ, СобытиеИстечения, Оповещаемые, Отказ);
				КонецЕсли;
				Если Не Отказ Тогда 
					НаборЗаписей = РегистрыСведений.гкс_ОтправленныеУведомленияОСроках.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ВыборкаДок.Документ);
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Документ = ВыборкаДок.Документ;
					НоваяЗапись.Статус = ВыборкаДок.Статус;
					НоваяЗапись.Способ = ВыборкаДок.Способ;
					НоваяЗапись.Событие = ИмяСобытия;
					НаборЗаписей.Записать();
				КонецЕсли;
			Иначе
				ИмяСобытия = "Просрочен";
				Если ЗначениеЗаполнено(СобытиеПросрочки) Тогда 
					торо_РаботаСУведомлениями.гкс_ЗаписатьУведомленияСрокаСогласования(ВыборкаДок.Документ, СобытиеПросрочки, Оповещаемые, Отказ);
				КонецЕсли;
				Если Не Отказ Тогда 
					НаборЗаписей = РегистрыСведений.гкс_ОтправленныеУведомленияОСроках.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ВыборкаДок.Документ);
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Документ = ВыборкаДок.Документ;
					НоваяЗапись.Статус = ВыборкаДок.Статус;
					НоваяЗапись.Способ = ВыборкаДок.Способ;
					НоваяЗапись.Событие = ИмяСобытия;
					НаборЗаписей.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
// гкс- [разработка 2021] Куст 13.05.2021
